app/controllers/articles_controller.rb

  def index
      # list of all articles (articles)
     @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def edit
    # uses the articles id to find the record
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def delete
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]